zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE32B/startup_MCXE32B_cm7_core0.cpp

//*****************************************************************************
// MCXE32B_cm7_core0 startup code
//
// Version : 090626
//*****************************************************************************
//
// Copyright 2016-2026 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif //(__GNUC__)
#endif //(DEBUG)

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif //(__REDLIB__)
#endif //(__MCUXPRESSO)
#endif //(__cplusplus)

#define WEAK __attribute__ ((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__ ((weak))
#endif // __MCUXPRESSO
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif //(__cplusplus)

//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif //(__MCUXPRESSO)
void Reset_Handler_C(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);
WEAK void DefaultISR1(uint32_t instance);
WEAK void DefaultISR4(uint32_t instance, uint32_t start, uint32_t end, uint32_t type);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void INT0_IRQHandler(void);
WEAK void INT1_IRQHandler(void);
WEAK void INT2_IRQHandler(void);
WEAK void INT3_IRQHandler(void);
WEAK void DMATCD0_IRQHandler(void);
WEAK void DMATCD1_IRQHandler(void);
WEAK void DMATCD2_IRQHandler(void);
WEAK void DMATCD3_IRQHandler(void);
WEAK void DMATCD4_IRQHandler(void);
WEAK void DMATCD5_IRQHandler(void);
WEAK void DMATCD6_IRQHandler(void);
WEAK void DMATCD7_IRQHandler(void);
WEAK void DMATCD8_IRQHandler(void);
WEAK void DMATCD9_IRQHandler(void);
WEAK void DMATCD10_IRQHandler(void);
WEAK void DMATCD11_IRQHandler(void);
WEAK void DMATCD12_IRQHandler(void);
WEAK void DMATCD13_IRQHandler(void);
WEAK void DMATCD14_IRQHandler(void);
WEAK void DMATCD15_IRQHandler(void);
WEAK void DMATCD16_IRQHandler(void);
WEAK void DMATCD17_IRQHandler(void);
WEAK void DMATCD18_IRQHandler(void);
WEAK void DMATCD19_IRQHandler(void);
WEAK void DMATCD20_IRQHandler(void);
WEAK void DMATCD21_IRQHandler(void);
WEAK void DMATCD22_IRQHandler(void);
WEAK void DMATCD23_IRQHandler(void);
WEAK void DMATCD24_IRQHandler(void);
WEAK void DMATCD25_IRQHandler(void);
WEAK void DMATCD26_IRQHandler(void);
WEAK void DMATCD27_IRQHandler(void);
WEAK void DMATCD28_IRQHandler(void);
WEAK void DMATCD29_IRQHandler(void);
WEAK void DMATCD30_IRQHandler(void);
WEAK void DMATCD31_IRQHandler(void);
WEAK void ERM_0_IRQHandler(void);
WEAK void ERM_1_IRQHandler(void);
WEAK void MCM_IRQHandler(void);
WEAK void STM0_IRQHandler(void);
WEAK void STM1_IRQHandler(void);
WEAK void Reserved57_IRQHandler(void);
WEAK void SWT0_IRQHandler(void);
WEAK void SWT1_IRQHandler(void);
WEAK void Reserved60_IRQHandler(void);
WEAK void CTI_INT0_IRQHandler(void);
WEAK void CTI_INT1_IRQHandler(void);
WEAK void Reserved63_IRQHandler(void);
WEAK void FLASH_0_IRQHandler(void);
WEAK void FLASH_1_IRQHandler(void);
WEAK void FLASH_2_IRQHandler(void);
WEAK void RGM_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void SIUL2_0_IRQHandler(void);
WEAK void SIUL2_1_IRQHandler(void);
WEAK void SIUL2_2_IRQHandler(void);
WEAK void SIUL2_3_IRQHandler(void);
WEAK void Reserved73_IRQHandler(void);
WEAK void Reserved74_IRQHandler(void);
WEAK void Reserved75_IRQHandler(void);
WEAK void Reserved76_IRQHandler(void);
WEAK void EMIOS0_2_IRQHandler(void);
WEAK void EMIOS0_3_IRQHandler(void);
WEAK void EMIOS0_4_IRQHandler(void);
WEAK void EMIOS0_5_IRQHandler(void);
WEAK void EMIOS0_6_IRQHandler(void);
WEAK void EMIOS0_7_IRQHandler(void);
WEAK void Reserved83_IRQHandler(void);
WEAK void Reserved84_IRQHandler(void);
WEAK void EMIOS1_2_IRQHandler(void);
WEAK void EMIOS1_3_IRQHandler(void);
WEAK void EMIOS1_4_IRQHandler(void);
WEAK void EMIOS1_5_IRQHandler(void);
WEAK void EMIOS1_6_IRQHandler(void);
WEAK void EMIOS1_7_IRQHandler(void);
WEAK void Reserved91_IRQHandler(void);
WEAK void Reserved92_IRQHandler(void);
WEAK void EMIOS2_2_IRQHandler(void);
WEAK void EMIOS2_3_IRQHandler(void);
WEAK void EMIOS2_4_IRQHandler(void);
WEAK void EMIOS2_5_IRQHandler(void);
WEAK void EMIOS2_6_IRQHandler(void);
WEAK void EMIOS2_7_IRQHandler(void);
WEAK void WKPU_IRQHandler(void);
WEAK void CMU0_IRQHandler(void);
WEAK void CMU1_IRQHandler(void);
WEAK void CMU2_IRQHandler(void);
WEAK void BCTU_IRQHandler(void);
WEAK void Reserved104_IRQHandler(void);
WEAK void Reserved105_IRQHandler(void);
WEAK void Reserved106_IRQHandler(void);
WEAK void Reserved107_IRQHandler(void);
WEAK void LCU0_IRQHandler(void);
WEAK void LCU1_IRQHandler(void);
WEAK void Reserved110_IRQHandler(void);
WEAK void Reserved111_IRQHandler(void);
WEAK void PIT0_IRQHandler(void);
WEAK void PIT1_IRQHandler(void);
WEAK void PIT2_IRQHandler(void);
WEAK void Reserved115_IRQHandler(void);
WEAK void Reserved116_IRQHandler(void);
WEAK void Reserved117_IRQHandler(void);
WEAK void RTC_IRQHandler(void);
WEAK void Reserved119_IRQHandler(void);
WEAK void Reserved120_IRQHandler(void);
WEAK void EMAC_0_IRQHandler(void);
WEAK void EMAC_1_IRQHandler(void);
WEAK void EMAC_2_IRQHandler(void);
WEAK void EMAC_3_IRQHandler(void);
WEAK void FlexCAN0_0_IRQHandler(void);
WEAK void FlexCAN0_1_IRQHandler(void);
WEAK void FlexCAN0_2_IRQHandler(void);
WEAK void FlexCAN0_3_IRQHandler(void);
WEAK void FlexCAN1_0_IRQHandler(void);
WEAK void FlexCAN1_1_IRQHandler(void);
WEAK void FlexCAN1_2_IRQHandler(void);
WEAK void FlexCAN2_0_IRQHandler(void);
WEAK void FlexCAN2_1_IRQHandler(void);
WEAK void FlexCAN2_2_IRQHandler(void);
WEAK void FlexCAN3_0_IRQHandler(void);
WEAK void FlexCAN3_1_IRQHandler(void);
WEAK void FlexCAN4_0_IRQHandler(void);
WEAK void FlexCAN4_1_IRQHandler(void);
WEAK void FlexCAN5_0_IRQHandler(void);
WEAK void FlexCAN5_1_IRQHandler(void);
WEAK void Reserved141_IRQHandler(void);
WEAK void Reserved142_IRQHandler(void);
WEAK void Reserved143_IRQHandler(void);
WEAK void Reserved144_IRQHandler(void);
WEAK void Reserved145_IRQHandler(void);
WEAK void Reserved146_IRQHandler(void);
WEAK void Reserved147_IRQHandler(void);
WEAK void Reserved148_IRQHandler(void);
WEAK void Reserved149_IRQHandler(void);
WEAK void Reserved150_IRQHandler(void);
WEAK void Reserved151_IRQHandler(void);
WEAK void Reserved152_IRQHandler(void);
WEAK void Reserved153_IRQHandler(void);
WEAK void Reserved154_IRQHandler(void);
WEAK void FLEXIO_IRQHandler(void);
WEAK void Reserved156_IRQHandler(void);
WEAK void LPUART_0_IRQHandler(void);
WEAK void LPUART_1_IRQHandler(void);
WEAK void LPUART_2_IRQHandler(void);
WEAK void LPUART_3_IRQHandler(void);
WEAK void LPUART_4_IRQHandler(void);
WEAK void LPUART_5_IRQHandler(void);
WEAK void LPUART_6_IRQHandler(void);
WEAK void LPUART_7_IRQHandler(void);
WEAK void LPUART_8_IRQHandler(void);
WEAK void LPUART_9_IRQHandler(void);
WEAK void LPUART_10_IRQHandler(void);
WEAK void LPUART_11_IRQHandler(void);
WEAK void LPUART_12_IRQHandler(void);
WEAK void LPUART_13_IRQHandler(void);
WEAK void LPUART_14_IRQHandler(void);
WEAK void LPUART_15_IRQHandler(void);
WEAK void Reserved173_IRQHandler(void);
WEAK void Reserved174_IRQHandler(void);
WEAK void Reserved175_IRQHandler(void);
WEAK void Reserved176_IRQHandler(void);
WEAK void LPI2C0_IRQHandler(void);
WEAK void LPI2C1_IRQHandler(void);
WEAK void Reserved179_IRQHandler(void);
WEAK void Reserved180_IRQHandler(void);
WEAK void LPSPI0_IRQHandler(void);
WEAK void LPSPI1_IRQHandler(void);
WEAK void LPSPI2_IRQHandler(void);
WEAK void LPSPI3_IRQHandler(void);
WEAK void LPSPI4_IRQHandler(void);
WEAK void LPSPI5_IRQHandler(void);
WEAK void Reserved187_IRQHandler(void);
WEAK void Reserved188_IRQHandler(void);
WEAK void QSPI_IRQHandler(void);
WEAK void SAI0_IRQHandler(void);
WEAK void SAI1_IRQHandler(void);
WEAK void Reserved192_IRQHandler(void);
WEAK void Reserved193_IRQHandler(void);
WEAK void JDC_IRQHandler(void);
WEAK void Reserved195_IRQHandler(void);
WEAK void ADC0_IRQHandler(void);
WEAK void ADC1_IRQHandler(void);
WEAK void ADC2_IRQHandler(void);
WEAK void CMP0_IRQHandler(void);
WEAK void CMP1_IRQHandler(void);
WEAK void CMP2_IRQHandler(void);
WEAK void Reserved202_IRQHandler(void);
WEAK void Reserved203_IRQHandler(void);
WEAK void Reserved204_IRQHandler(void);
WEAK void FCCU_0_IRQHandler(void);
WEAK void FCCU_1_IRQHandler(void);
WEAK void STCU_IRQHandler(void);
WEAK void MU0_B_TX_IRQHandler(void);
WEAK void MU0_B_RX_IRQHandler(void);
WEAK void MU0_B_IRQHandler(void);
WEAK void MU1_B_TX_IRQHandler(void);
WEAK void MU1_B_RX_IRQHandler(void);
WEAK void MU1_B_IRQHandler(void);
WEAK void Reserved214_IRQHandler(void);
WEAK void Reserved215_IRQHandler(void);
WEAK void Reserved216_IRQHandler(void);
WEAK void Reserved217_IRQHandler(void);
WEAK void MU2_A_TX_IRQHandler(void);
WEAK void MU2_A_RX_IRQHandler(void);
WEAK void MU2_A_IRQHandler(void);
WEAK void MU2_B_TX_IRQHandler(void);
WEAK void MU2_B_RX_IRQHandler(void);
WEAK void MU2_B_IRQHandler(void);
WEAK void Reserved224_IRQHandler(void);
WEAK void Reserved225_IRQHandler(void);
WEAK void Reserved226_IRQHandler(void);
WEAK void Reserved227_IRQHandler(void);
WEAK void PLL_LOL_IRQHandler(void);
WEAK void CORE_CLK_FAIL_IRQHandler(void);
WEAK void Reserved230_IRQHandler(void);
WEAK void AIPS_PLAT_CLK_FAIL_IRQHandler(void);
WEAK void Reserved232_IRQHandler(void);
WEAK void HSE_B_CLK_FAIL_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void INT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void INT3_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD0_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD1_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD2_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD3_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD4_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD5_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD6_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD7_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD8_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD9_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD10_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD11_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD12_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD13_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD14_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD15_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD16_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD17_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD18_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD19_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD20_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD21_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD22_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD23_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD24_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD25_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD26_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD27_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD28_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD29_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD30_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMATCD31_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ERM_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void MCM_DriverIRQHandler(void) ALIAS(DefaultISR);
void STM_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved57_DriverIRQHandler(void) ALIAS(DefaultISR);
void SWT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SWT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved60_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTI_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTI_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved63_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void RGM_DriverIRQHandler(void) ALIAS(DefaultISR);
void PMC_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void SIUL2_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved73_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved74_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved75_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved76_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS0_7_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved83_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved84_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS1_7_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved91_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved92_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS2_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS2_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS2_4_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS2_5_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS2_6_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMIOS2_7_DriverIRQHandler(void) ALIAS(DefaultISR);
void WKPU_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMU_FC_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void CMU_FM_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void BCTU_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved104_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved105_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved106_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved107_DriverIRQHandler(void) ALIAS(DefaultISR);
void LCU0_DriverIRQHandler(void) ALIAS(DefaultISR);
void LCU1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved110_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved111_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved115_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved116_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved117_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved119_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved120_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMAC_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMAC_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMAC_2_DriverIRQHandler(void) ALIAS(DefaultISR);
void EMAC_3_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXCAN_DriverDataIRQHandler(uint32_t instance, uint32_t start, uint32_t end) ALIAS(DefaultISR3);
void FLEXCAN_DriverEventIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved141_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved142_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved143_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved144_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved145_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved146_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved147_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved148_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved149_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved150_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved151_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved152_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved153_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved154_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved156_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPUART_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved173_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved174_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved175_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved176_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPI2C_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved179_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved180_DriverIRQHandler(void) ALIAS(DefaultISR);
void LPSPI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved187_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved188_DriverIRQHandler(void) ALIAS(DefaultISR);
void QSPI_DriverIRQHandler(void) ALIAS(DefaultISR);
void SAI_DriverIRQHandler(uint32_t instance) ALIAS(DefaultISR1);
void Reserved192_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved193_DriverIRQHandler(void) ALIAS(DefaultISR);
void JDC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved195_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC0_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC1_DriverIRQHandler(void) ALIAS(DefaultISR);
void ADC2_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP1_DriverIRQHandler(void) ALIAS(DefaultISR);
void CMP2_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved202_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved203_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved204_DriverIRQHandler(void) ALIAS(DefaultISR);
void FCCU_0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FCCU_1_DriverIRQHandler(void) ALIAS(DefaultISR);
void STCU_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_B_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_B_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU0_B_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU1_B_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved214_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved215_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved216_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved217_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU2_A_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU2_A_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU2_A_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU2_B_TX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU2_B_RX_DriverIRQHandler(void) ALIAS(DefaultISR);
void MU2_B_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved224_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved225_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved226_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved227_DriverIRQHandler(void) ALIAS(DefaultISR);
void PLL_LOL_DriverIRQHandler(void) ALIAS(DefaultISR);
void CORE_CLK_FAIL_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved230_DriverIRQHandler(void) ALIAS(DefaultISR);
void AIPS_PLAT_CLK_FAIL_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved232_DriverIRQHandler(void) ALIAS(DefaultISR);
void HSE_B_CLK_FAIL_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void __main(void);
#elif defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif //(__REDLIB__)
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif //(__REDLIB__)
#else
#error Unsupported toolchain!
#endif //(__MCUXPRESSO)

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
#elif defined(__ICCARM__)
#pragma segment="CSTACK"
#define __StackTop __section_end("CSTACK")
#define __StackBase __section_begin("CSTACK")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];

extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];

extern uint32_t __ram_function_flash_start[];
extern uint32_t __ram_function_start__[];
extern uint32_t __ram_function_end__[];

extern uint32_t __noncache_data_flash_start[];
extern uint32_t __noncache_data_start__[];
extern uint32_t __noncache_data_end__[];

